%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
%  FileName:            rxDemod.m
%  Description:         解调
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
%  Parameter List:       
%       Output Parameter
%           outData	解调数据bit流
%       Input Parameter
%           inputData	输入待解调 复数符号数据（一维，如[-0.8+0.87i,0.9+0.6i...]）
%           modType  调制类型，1表示QPSK
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
%  History
%    1. Date:           2018-05-26
%       Author:         tony liu
%       Version:        1.0 
%       Modification:   初稿
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
%%%%%%%%程序框架%%%%%%%%%%%%%
function outData=rxDemod(inputData,modType)

%%%%%%%%%%%%%%%%%%%%%%%%% student code %%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
% task：根据inputData 数据所在象限，对其进行解调制映射。



 



%解调后信号实部为奇数路，解调后信号虚部为偶数路，组成复数信号outData



%%%%%%%%%%%%%%%%%%%%%%%%%%%% end %%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
else
    disp('输入参数不支持')
end
%%%%%%%%程序框架END%%%%%%%%%%%%%