%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
%  FileName:            txMod.m
%  Description:         调制
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
%  Parameter List:       
%       Output Parameter
%           outData	调制后符号数据  （一维 复数，带实部虚部，如[1+i，1-i，1-i]）
%       Input Parameter
%           inputData	输入待调制bit流 （一维 0,1比特数据，如[0,0,0,1]）
%           modType  调制类型，1表示QPSK
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
%  History
%    1. Date:           2018-05-25
%       Author:         tony liu
%       Version:        1.0 
%       Modification:   初稿
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
function outData=txMod(inputData,modType)

%%%%%%%%%%%%%%%%%%%%%%%%% student code %%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
% task: 对输入的inputData比特数据进行QPSK调制。
% 提示：1.对inputData数据进行映射，0映射为1，1映射为-1。
%       2.取映射后的inputData数据奇数位作为调制符号的实部，偶数位作为调制符号的虚部，生成的复数为调制符号数据outData。





%%%%%%%%%%%%%%%%%%%%%%%%%%%% end %%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
else disp('输入参数不支持');
end