%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
%  FileName:             CDMA_cpich.m
%  Description:         插入导频
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
%  Parameter List:       
%       Output Parameter
%           data_i	I路数据
%           data_q	Q路数据
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
function [data_i,data_q] = CDMA_cpich
% %导频信道数据，3GPP TS 25.211, 5.3.3.1 Common Pilot Channel (CPICH)
%%%%%%%%%%%%%%% student code %%%%%%%%%%%%%%%%%%%%%%%
%生成导频数据cpich_data，并进行映射，0映射为1，1映射为-1


%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%

% %串并转换
%%%%%%%%%%%%%%% student code %%%%%%%%%%%%%%%%%%%%%%%
%对映射后导频数据进行串并转换得到data_i，data_q

%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%

end